# Data Manipulation using Pandas

In [2]:
import numpy as np
import pandas as pd

In [18]:
pd.__version__

'1.0.1'

In [34]:
pd

# Series

In [36]:
data=pd.Series([1,2,3])

In [37]:
data

0    1
1    2
2    3
dtype: int64

In [39]:
l=['x','y','z']
data.index=l
data

x    1
y    2
z    3
dtype: int64

In [44]:
l=['a','b','c','d','e','f']
pd.Series(np.linspace(0,10,6), index=l)

a     0.0
b     2.0
c     4.0
d     6.0
e     8.0
f    10.0
dtype: float64

In [64]:
d={'name':'Anil Krish', 'class':'E2-CSE', 'role':'Scientist'}
data=pd.Series(d)
data

name     Anil Krish
class        E2-CSE
role      Scientist
dtype: object

In [53]:
data.values

array(['Anil Krish', 'E2-CSE', 'Scientist'], dtype=object)

In [54]:
data.index

Index(['name', 'class', 'role'], dtype='object')

In [57]:
#Accessing the element by index 'role'
data['role']='Data Scientist'
data

name         Anil Krish
class            E2-CSE
role     Data Scientist
dtype: object

In [61]:
#slicing from name to role
data['name':'role']

name     Anil Krish
class        E2-CSE
role      Scientist
dtype: object

In [69]:
new=pd.Series([222,444,666], index=[1,2,3])
new

1    222
2    444
3    666
dtype: int64

In [86]:
d={4:'Anil Krish', 3:'Sudheer', 1:'Rehman', 2:'Lokesh'}
students=pd.Series(d, index=[4,1,7])
students

4    Anil Krish
1        Rehman
7           NaN
dtype: object

In [88]:
d={4:'Anil Krish', 3:'Sudheer', 1:'Rehman', 2:'Lokesh'}
students=pd.Series(d)

In [90]:
students

4    Anil Krish
3       Sudheer
1        Rehman
2        Lokesh
dtype: object

# DataFrame

In [143]:
ids=pd.Series({'Anil': 'R180864', 'Sudheer':'R180340', 'Lokesh':'R181012', 'Rehaman':'R180603'})
branch=pd.Series({'Anil':'CSE', 'Rehaman':'CSE', 'Sudheer':'ECE', 'Sukumar':'ECE'})
surname=pd.Series({'Anil': 'Maddineni', 'Sudheer':'Poluru', 'Lokesh':'Talari', 'Rehaman':'Shaik', 'Sukumar':'Beesu'})
sec=pd.Series({'Anil': 'F001', 'Sudheer':'G008', 'Lokesh':'F006', 'Rehaman':'F008', 'Sukumar':'F001'})
students=pd.DataFrame({'Surname':surname, 'Id':ids, 'Branch':branch, 'Section': sec})
students

           Surname       Id Branch Section
Anil     Maddineni  R180864    CSE    F001
Lokesh      Talari  R181012    NaN    F006
Rehaman      Shaik  R180603    CSE    F008
Sudheer     Poluru  R180340    ECE    G008
Sukumar      Beesu      NaN    ECE    F001

In [63]:
students.index

Index(['Anil', 'Lokesh', 'Rehaman', 'Sudheer', 'Sukumar'], dtype='object')

In [65]:
students.values

array([['Maddineni', 'R180864', 'CSE'],
       ['Talari', 'R181012', nan],
       ['Shaik', 'R180603', 'CSE'],
       ['Poluru', 'R180340', 'ECE'],
       ['Beesu', nan, 'ECE']], dtype=object)

In [66]:
students.columns

Index(['Surname', 'Id', 'Branch'], dtype='object')

In [72]:
#To access any column of all the indexes
students['Surname']

Anil       Maddineni
Lokesh        Talari
Rehaman        Shaik
Sudheer       Poluru
Sukumar        Beesu
Name: Surname, dtype: object

In [151]:
students.Surname

Anil       Maddineni
Lokesh        Talari
Rehaman        Shaik
Sudheer       Poluru
Sukumar        Beesu
Name: Surname, dtype: object

In [95]:
#To access column of all the indexes by displaying the Column Name
#We have to pass the column names within a List
students[['Surname', 'Branch']]

           Surname Branch
Anil     Maddineni    CSE
Lokesh      Talari    NaN
Rehaman      Shaik    CSE
Sudheer     Poluru    ECE
Sukumar      Beesu    ECE

In [104]:
#To access multiple(specified) columns and specied indexes
#We will use slice operator just like python List
students[['Branch', 'Id']][:'Sudheer':2]

        Branch       Id
Anil       CSE  R180864
Rehaman    CSE  R180603

In [105]:
#We can use indexes as 0,1,2,3,.... to access the specifies=d index values
students[['Surname', 'Branch']][:4:2]

           Surname Branch
Anil     Maddineni    CSE
Rehaman      Shaik    CSE

In [126]:
#If we try to access multiple columns without using List, we will get an error
students[['Branch', 'Id']]['Anil']

KeyError: 'Anil'

In [144]:
#We can alse extract the values whatever we want using certain constraints
#Extract those students whose Branch is CSE
students[students['Branch']=='CSE']

           Surname       Id Branch Section
Anil     Maddineni  R180864    CSE    F001
Rehaman      Shaik  R180603    CSE    F008

In [150]:
students[students['Section']=='F001']

           Surname       Id Branch Section
Anil     Maddineni  R180864    CSE    F001
Sukumar      Beesu      NaN    ECE    F001

In [76]:
data=pd.DataFrame(surname, columns=['Sur'])
data

               Sur
Anil     Maddineni
Sudheer     Poluru
Lokesh      Talari
Rehaman      Shaik
Sukumar      Beesu

In [83]:
d={'name':['Anil Krish'], 'class':['E2-CSE'], 'role':['Data Scientist']}
data=pd.DataFrame(d)
data

         name   class            role
0  Anil Krish  E2-CSE  Data Scientist

# Date_Range

In [183]:
#To get range of dates
#Here dates are ased og Day='d'
dates=pd.date_range(start='2022-08-12', periods=6, freq='d')
dates

DatetimeIndex(['2022-08-12', '2022-08-13', '2022-08-14', '2022-08-15',
               '2022-08-16', '2022-08-17'],
              dtype='datetime64[ns]', freq='D')

In [190]:
#Here dates are based on Month='m'
#Regardless given date, it will calulate all the dates at the end of the month
dates=pd.date_range(start='2022-08-12', periods=5, freq='m')
dates

DatetimeIndex(['2022-08-31', '2022-09-30', '2022-10-31', '2022-11-30',
               '2022-12-31'],
              dtype='datetime64[ns]', freq='M')

In [192]:
students.index=dates
students

              Surname       Id Branch Section
2022-08-31  Maddineni  R180864    CSE    F001
2022-09-30     Talari  R181012    NaN    F006
2022-10-31      Shaik  R180603    CSE    F008
2022-11-30     Poluru  R180340    ECE    G008
2022-12-31      Beesu      NaN    ECE    F001

In [185]:
#Here dates are based on Year='y'
#Regardless given date, it will calulate all the dates at the end of the year
dates=pd.date_range(start='2022-08-12', periods=6, freq='y')
dates

DatetimeIndex(['2022-12-31', '2023-12-31', '2024-12-31', '2025-12-31',
               '2026-12-31', '2027-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [186]:
#Here dates are based on Quarter='q'
#Regardless given date, it will calulate all the dates at the end of the Quarter
dates=pd.date_range(start='2022-08-12', periods=6, freq='q')
dates

DatetimeIndex(['2022-09-30', '2022-12-31', '2023-03-31', '2023-06-30',
               '2023-09-30', '2023-12-31'],
              dtype='datetime64[ns]', freq='Q-DEC')

In [187]:
#Here dates are based on Week='w'
#Regardless given date, it will calulate all the dates at the end of the Week(i.e., Sunday)
dates=pd.date_range(start='2022-08-12', periods=6, freq='w')
dates

DatetimeIndex(['2022-08-14', '2022-08-21', '2022-08-28', '2022-09-04',
               '2022-09-11', '2022-09-18'],
              dtype='datetime64[ns]', freq='W-SUN')

In [177]:
pd.date_range?

In [87]:
l=[{'a':i*i, 'b':i**3} for i in range(6)]
data=pd.DataFrame(l)
data

    a    b
0   0    0
1   1    1
2   4    8
3   9   27
4  16   64
5  25  125

In [59]:
data.columns=['Square', 'Cube']
data

     Square  Cube
0's       0     0
1's       1     1
2's       4     8
3's       9    27
4's      16    64
5's      25   125

In [60]:
data.index=["0's", "1's", "2's", "3's", "4's", "5's"]
data

     Square  Cube
0's       0     0
1's       1     1
2's       4     8
3's       9    27
4's      16    64
5's      25   125

In [32]:
data['Cube'][4]=999
data

     Square  Cube
0's       0     0
1's       1     1
2's       4     8
3's       9    27
4's      16   999
5's      25   125

In [88]:
data[['a']][2:]

    a
2   4
3   9
4  16
5  25

In [51]:
type(data)

pandas.core.frame.DataFrame

In [52]:
type(data.index)

pandas.core.indexes.range.RangeIndex

In [53]:
type(data.columns)

pandas.core.indexes.base.Index

In [54]:
type(data.values)

numpy.ndarray

In [55]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [58]:
for i in data.index:
    print(i)

0's
1's
2's
3's
4's
5's